IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_clb_logic_config_regs.xml
<module id="CLB_LOGIC_CONFIG_REGS" HW_revision="" description="CLB LOGIC CONFIG Registers">
	<register id="CLB_COUNT_RESET" width="32" page="1" offset="0x2" internal="0" description="Counter Block RESET">
		<bitfield id="SEL_0" description="Count Reset Select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Count Reset Select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Count Reset Select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_COUNT_MODE_1" width="32" page="1" offset="0x4" internal="0" description="Counter Block MODE_1">
		<bitfield id="SEL_0" description="Counter mode 1 select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Counter mode 1 select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Counter mode 1 select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_COUNT_MODE_0" width="32" page="1" offset="0x6" internal="0" description="Counter Block MODE_0">
		<bitfield id="SEL_0" description="Counter mode 0 select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Counter mode 0 select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Counter mode 0 select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_COUNT_EVENT" width="32" page="1" offset="0x8" internal="0" description="Counter Block EVENT">
		<bitfield id="SEL_0" description="Counter event select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Counter event select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Counter event select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_EXTRA_IN0" width="32" page="1" offset="0xa" internal="0" description="FSM Extra EXT_IN0">
		<bitfield id="SEL_0" description="FSM extra ext input select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="FSM extra ext input select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="FSM extra ext input select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_EXTERNAL_IN0" width="32" page="1" offset="0xc" internal="0" description="FSM EXT_IN0">
		<bitfield id="SEL_0" description="FSM EXT_IN0 select input for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="FSM EXT_IN0 select input for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="FSM EXT_IN0 select input for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_EXTERNAL_IN1" width="32" page="1" offset="0xe" internal="0" description="FSM_EXT_IN1">
		<bitfield id="SEL_0" description="FSM EXT_IN1 select input for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="FSM EXT_IN1 select input for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="FSM EXT_IN1 select input for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_EXTRA_IN1" width="32" page="1" offset="0x10" internal="0" description="FSM Extra_EXT_IN1">
		<bitfield id="SEL_0" description="FSM extra ext input select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="FSM extra ext input select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="FSM extra ext input select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_IN0" width="32" page="1" offset="0x12" internal="0" description="LUT4_0/1/2 IN0 input source">
		<bitfield id="SEL_0" description="Select inputs for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Select inputs for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Select inputs for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_IN1" width="32" page="1" offset="0x14" internal="0" description="LUT4_0/1/2 IN1 input source">
		<bitfield id="SEL_0" description="Select inputs for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Select inputs for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Select inputs for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_IN2" width="32" page="1" offset="0x16" internal="0" description="LUT4_0/1/2 IN2 input source">
		<bitfield id="SEL_0" description="Select inputs for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Select inputs for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Select inputs for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_IN3" width="32" page="1" offset="0x18" internal="0" description="LUT4_0/1/2 IN3 input source">
		<bitfield id="SEL_0" description="Select inputs for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Select inputs for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Select inputs for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_LUT_FN1_0" width="32" page="1" offset="0x1c" internal="0" description="LUT function for FSM Unit 1 and Unit 0">
		<bitfield id="FN0" description="FSM LUT output function for unit 0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="FN1" description="FSM LUT output function for unit 1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_LUT_FN2" width="32" page="1" offset="0x1e" internal="0" description="LUT function for FSM Unit 2">
		<bitfield id="FN1" description="FSM LUT output function for unit 2" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
